; domain
(define (domain elevators-sequencedstrips)
  (:requirements :typing :action-costs)
  (:types 	elevator - object
			slow-elevator fast-elevator - elevator
   			passenger - object
          	count - object
         )

(:predicates
	(passenger-at ?person - passenger ?floor - count)
	(boarded ?person - passenger ?lift - elevator)
	(lift-at ?lift - elevator ?floor - count)
	(reachable-floor ?lift - elevator ?floor - count)
	(above ?floor1 - count ?floor2 - count)
	(passengers ?lift - elevator ?n - count)
	(can-hold ?lift - elevator ?n - count)
	(next ?n1 - count ?n2 - count)
)

(:functions (total-cost) - number
            (travel-slow ?f1 - count ?f2 - count) - number
            (travel-fast ?f1 - count ?f2 - count) - number
)

(:action move-up-slow
  :parameters (?lift - slow-elevator ?f1 - count ?f2 - count )
  :precondition (and (lift-at ?lift ?f1) (above ?f1 ?f2 ) (reachable-floor ?lift ?f2) )
  :effect (and (lift-at ?lift ?f2) (not (lift-at ?lift ?f1)) (increase (total-cost) (travel-slow ?f1 ?f2))))

(:action move-down-slow
  :parameters (?lift - slow-elevator ?f1 - count ?f2 - count )
  :precondition (and (lift-at ?lift ?f1) (above ?f2 ?f1 ) (reachable-floor ?lift ?f2) )
  :effect (and (lift-at ?lift ?f2) (not (lift-at ?lift ?f1)) (increase (total-cost) (travel-slow ?f2 ?f1))))

(:action move-up-fast
  :parameters (?lift - fast-elevator ?f1 - count ?f2 - count )
  :precondition (and (lift-at ?lift ?f1) (above ?f1 ?f2 ) (reachable-floor ?lift ?f2) )
  :effect (and (lift-at ?lift ?f2) (not (lift-at ?lift ?f1)) (increase (total-cost) (travel-fast ?f1 ?f2))))

(:action move-down-fast
  :parameters (?lift - fast-elevator ?f1 - count ?f2 - count )
  :precondition (and (lift-at ?lift ?f1) (above ?f2 ?f1 ) (reachable-floor ?lift ?f2) )
  :effect (and (lift-at ?lift ?f2) (not (lift-at ?lift ?f1)) (increase (total-cost) (travel-fast ?f2 ?f1))))

(:action board
  :parameters (?p - passenger ?lift - elevator ?f - count ?n1 - count ?n2 - count)
  :precondition (and  (lift-at ?lift ?f) (passenger-at ?p ?f) (passengers ?lift ?n1) (next ?n1 ?n2) (can-hold ?lift ?n2) )
  :effect (and (not (passenger-at ?p ?f)) (boarded ?p ?lift) (not (passengers ?lift ?n1)) (passengers ?lift ?n2) ))

(:action leave
  :parameters (?p - passenger ?lift - elevator ?f - count ?n1 - count ?n2 - count)
  :precondition (and  (lift-at ?lift ?f) (boarded ?p ?lift) (passengers ?lift ?n1) (next ?n2 ?n1) )
  :effect (and (passenger-at ?p ?f) (not (boarded ?p ?lift)) (not (passengers ?lift ?n1)) (passengers ?lift ?n2) ))

)

; problem
; 17 floors, area size: 4, areas: 4, passengers: 4
(define (problem elevators)
(:domain elevators-sequencedstrips)
    (:objects
       n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 n13 n14 n15 n16 - count
       p0 p1 p2 p3 - passenger
       fast0 fast1 - fast-elevator
       slow0-0 slow1-0 slow2-0 slow3-0 - slow-elevator
    )

    (:init
       (next n0 n1)
       (next n1 n2)
       (next n2 n3)
       (next n3 n4)
       (next n4 n5)
       (next n5 n6)
       (next n6 n7)
       (next n7 n8)
       (next n8 n9)
       (next n9 n10)
       (next n10 n11)
       (next n11 n12)
       (next n12 n13)
       (next n13 n14)
       (next n14 n15)
       (next n15 n16)

       (above n0 n1)
       (above n0 n2)
       (above n0 n3)
       (above n0 n4)
       (above n0 n5)
       (above n0 n6)
       (above n0 n7)
       (above n0 n8)
       (above n0 n9)
       (above n0 n10)
       (above n0 n11)
       (above n0 n12)
       (above n0 n13)
       (above n0 n14)
       (above n0 n15)
       (above n0 n16)
       (above n1 n2)
       (above n1 n3)
       (above n1 n4)
       (above n1 n5)
       (above n1 n6)
       (above n1 n7)
       (above n1 n8)
       (above n1 n9)
       (above n1 n10)
       (above n1 n11)
       (above n1 n12)
       (above n1 n13)
       (above n1 n14)
       (above n1 n15)
       (above n1 n16)
       (above n2 n3)
       (above n2 n4)
       (above n2 n5)
       (above n2 n6)
       (above n2 n7)
       (above n2 n8)
       (above n2 n9)
       (above n2 n10)
       (above n2 n11)
       (above n2 n12)
       (above n2 n13)
       (above n2 n14)
       (above n2 n15)
       (above n2 n16)
       (above n3 n4)
       (above n3 n5)
       (above n3 n6)
       (above n3 n7)
       (above n3 n8)
       (above n3 n9)
       (above n3 n10)
       (above n3 n11)
       (above n3 n12)
       (above n3 n13)
       (above n3 n14)
       (above n3 n15)
       (above n3 n16)
       (above n4 n5)
       (above n4 n6)
       (above n4 n7)
       (above n4 n8)
       (above n4 n9)
       (above n4 n10)
       (above n4 n11)
       (above n4 n12)
       (above n4 n13)
       (above n4 n14)
       (above n4 n15)
       (above n4 n16)
       (above n5 n6)
       (above n5 n7)
       (above n5 n8)
       (above n5 n9)
       (above n5 n10)
       (above n5 n11)
       (above n5 n12)
       (above n5 n13)
       (above n5 n14)
       (above n5 n15)
       (above n5 n16)
       (above n6 n7)
       (above n6 n8)
       (above n6 n9)
       (above n6 n10)
       (above n6 n11)
       (above n6 n12)
       (above n6 n13)
       (above n6 n14)
       (above n6 n15)
       (above n6 n16)
       (above n7 n8)
       (above n7 n9)
       (above n7 n10)
       (above n7 n11)
       (above n7 n12)
       (above n7 n13)
       (above n7 n14)
       (above n7 n15)
       (above n7 n16)
       (above n8 n9)
       (above n8 n10)
       (above n8 n11)
       (above n8 n12)
       (above n8 n13)
       (above n8 n14)
       (above n8 n15)
       (above n8 n16)
       (above n9 n10)
       (above n9 n11)
       (above n9 n12)
       (above n9 n13)
       (above n9 n14)
       (above n9 n15)
       (above n9 n16)
       (above n10 n11)
       (above n10 n12)
       (above n10 n13)
       (above n10 n14)
       (above n10 n15)
       (above n10 n16)
       (above n11 n12)
       (above n11 n13)
       (above n11 n14)
       (above n11 n15)
       (above n11 n16)
       (above n12 n13)
       (above n12 n14)
       (above n12 n15)
       (above n12 n16)
       (above n13 n14)
       (above n13 n15)
       (above n13 n16)
       (above n14 n15)
       (above n14 n16)
       (above n15 n16)

       (lift-at fast0 n0)
       (passengers fast0 n0)
       (can-hold fast0 n1) (can-hold fast0 n2) (can-hold fast0 n3)
       (reachable-floor fast0 n0) (reachable-floor fast0 n2) (reachable-floor fast0 n4) (reachable-floor fast0 n6) (reachable-floor fast0 n8) (reachable-floor fast0 n10) (reachable-floor fast0 n12) (reachable-floor fast0 n14) (reachable-floor fast0 n16)
    
       (lift-at fast1 n4)
       (passengers fast1 n0)
       (can-hold fast1 n1) (can-hold fast1 n2) (can-hold fast1 n3)
       (reachable-floor fast1 n0) (reachable-floor fast1 n2) (reachable-floor fast1 n4) (reachable-floor fast1 n6) (reachable-floor fast1 n8) (reachable-floor fast1 n10) (reachable-floor fast1 n12) (reachable-floor fast1 n14) (reachable-floor fast1 n16)
    
       (lift-at slow0-0 n3)
       (passengers slow0-0 n0)
       (can-hold slow0-0 n1) (can-hold slow0-0 n2)
       (reachable-floor slow0-0 n0) (reachable-floor slow0-0 n1) (reachable-floor slow0-0 n2) (reachable-floor slow0-0 n3) (reachable-floor slow0-0 n4)
    
       (lift-at slow1-0 n6)
       (passengers slow1-0 n0)
       (can-hold slow1-0 n1) (can-hold slow1-0 n2)
       (reachable-floor slow1-0 n4) (reachable-floor slow1-0 n5) (reachable-floor slow1-0 n6) (reachable-floor slow1-0 n7) (reachable-floor slow1-0 n8)
    
       (lift-at slow2-0 n8)
       (passengers slow2-0 n0)
       (can-hold slow2-0 n1) (can-hold slow2-0 n2)
       (reachable-floor slow2-0 n8) (reachable-floor slow2-0 n9) (reachable-floor slow2-0 n10) (reachable-floor slow2-0 n11) (reachable-floor slow2-0 n12)
    
       (lift-at slow3-0 n12)
       (passengers slow3-0 n0)
       (can-hold slow3-0 n1) (can-hold slow3-0 n2)
       (reachable-floor slow3-0 n12) (reachable-floor slow3-0 n13) (reachable-floor slow3-0 n14) (reachable-floor slow3-0 n15) (reachable-floor slow3-0 n16)
    

       (passenger-at p0 n3)
       (passenger-at p1 n9)
       (passenger-at p2 n10)
       (passenger-at p3 n1)

       (= (travel-slow n0 n1) 6)
       (= (travel-slow n0 n2) 7)
       (= (travel-slow n0 n3) 8)
       (= (travel-slow n0 n4) 9)
       (= (travel-slow n1 n2) 6)
       (= (travel-slow n1 n3) 7)
       (= (travel-slow n1 n4) 8)
       (= (travel-slow n2 n3) 6)
       (= (travel-slow n2 n4) 7)
       (= (travel-slow n3 n4) 6)
       (= (travel-slow n4 n5) 6)
       (= (travel-slow n4 n6) 7)
       (= (travel-slow n4 n7) 8)
       (= (travel-slow n4 n8) 9)
       (= (travel-slow n5 n6) 6)
       (= (travel-slow n5 n7) 7)
       (= (travel-slow n5 n8) 8)
       (= (travel-slow n6 n7) 6)
       (= (travel-slow n6 n8) 7)
       (= (travel-slow n7 n8) 6)
       (= (travel-slow n8 n9) 6)
       (= (travel-slow n8 n10) 7)
       (= (travel-slow n8 n11) 8)
       (= (travel-slow n8 n12) 9)
       (= (travel-slow n9 n10) 6)
       (= (travel-slow n9 n11) 7)
       (= (travel-slow n9 n12) 8)
       (= (travel-slow n10 n11) 6)
       (= (travel-slow n10 n12) 7)
       (= (travel-slow n11 n12) 6)
       (= (travel-slow n12 n13) 6)
       (= (travel-slow n12 n14) 7)
       (= (travel-slow n12 n15) 8)
       (= (travel-slow n12 n16) 9)
       (= (travel-slow n13 n14) 6)
       (= (travel-slow n13 n15) 7)
       (= (travel-slow n13 n16) 8)
       (= (travel-slow n14 n15) 6)
       (= (travel-slow n14 n16) 7)
       (= (travel-slow n15 n16) 6)
       (= (travel-fast n0 n2) 7)
       (= (travel-fast n0 n4) 13)
       (= (travel-fast n0 n6) 19)
       (= (travel-fast n0 n8) 25)
       (= (travel-fast n0 n10) 31)
       (= (travel-fast n0 n12) 37)
       (= (travel-fast n0 n14) 43)
       (= (travel-fast n0 n16) 49)
       (= (travel-fast n2 n4) 7)
       (= (travel-fast n2 n6) 13)
       (= (travel-fast n2 n8) 19)
       (= (travel-fast n2 n10) 25)
       (= (travel-fast n2 n12) 31)
       (= (travel-fast n2 n14) 37)
       (= (travel-fast n2 n16) 43)
       (= (travel-fast n4 n6) 7)
       (= (travel-fast n4 n8) 13)
       (= (travel-fast n4 n10) 19)
       (= (travel-fast n4 n12) 25)
       (= (travel-fast n4 n14) 31)
       (= (travel-fast n4 n16) 37)
       (= (travel-fast n6 n8) 7)
       (= (travel-fast n6 n10) 13)
       (= (travel-fast n6 n12) 19)
       (= (travel-fast n6 n14) 25)
       (= (travel-fast n6 n16) 31)
       (= (travel-fast n8 n10) 7)
       (= (travel-fast n8 n12) 13)
       (= (travel-fast n8 n14) 19)
       (= (travel-fast n8 n16) 25)
       (= (travel-fast n10 n12) 7)
       (= (travel-fast n10 n14) 13)
       (= (travel-fast n10 n16) 19)
       (= (travel-fast n12 n14) 7)
       (= (travel-fast n12 n16) 13)
       (= (travel-fast n14 n16) 7)

       (= (total-cost) 0)
    )

    (:goal (and
       (passenger-at p0 n10)
       (passenger-at p1 n5)
       (passenger-at p2 n15)
       (passenger-at p3 n13)
    ))

    (:metric minimize (total-cost))
)

; plan
1. (move-up-slow slow2-0 n8 n9)
   deleted: (lift-at slow2-0 n8)
   added: (lift-at slow2-0 n9)
   goals met: 0 of 4
2. (move-up-slow slow1-0 n6 n8)
   deleted: (lift-at slow1-0 n6)
   added: (lift-at slow1-0 n8)
   goals met: 0 of 4
3. (board p0 slow0-0 n3 n0 n1)
   deleted: (passenger-at p0 n3) (passengers slow0-0 n0)
   added: (boarded p0 slow0-0) (passengers slow0-0 n1)
   goals met: 0 of 4
4. (move-down-slow slow0-0 n3 n1)
   deleted: (lift-at slow0-0 n3)
   added: (lift-at slow0-0 n1)
   goals met: 0 of 4
5. (board p3 slow0-0 n1 n1 n2)
   deleted: (passenger-at p3 n1) (passengers slow0-0 n1)
   added: (boarded p3 slow0-0) (passengers slow0-0 n2)
   goals met: 0 of 4
6. (move-down-slow slow0-0 n1 n0)
   deleted: (lift-at slow0-0 n1)
   added: (lift-at slow0-0 n0)
   goals met: 0 of 4
7. (leave p3 slow0-0 n0 n2 n1)
   deleted: (boarded p3 slow0-0) (passengers slow0-0 n2)
   added: (passenger-at p3 n0) (passengers slow0-0 n1)
   goals met: 0 of 4
8. (leave p0 slow0-0 n0 n1 n0)
   deleted: (boarded p0 slow0-0) (passengers slow0-0 n1)
   added: (passenger-at p0 n0) (passengers slow0-0 n0)
   goals met: 0 of 4
9. (board p3 fast0 n0 n0 n1)
   deleted: (passenger-at p3 n0) (passengers fast0 n0)
   added: (boarded p3 fast0) (passengers fast0 n1)
   goals met: 0 of 4
10. (board p0 fast0 n0 n1 n2)
   deleted: (passenger-at p0 n0) (passengers fast0 n1)
   added: (boarded p0 fast0) (passengers fast0 n2)
   goals met: 0 of 4
11. (move-up-fast fast0 n0 n10)
   deleted: (lift-at fast0 n0)
   added: (lift-at fast0 n10)
   goals met: 0 of 4
12. (board p1 slow2-0 n9 n0 n1)
   deleted: (passenger-at p1 n9) (passengers slow2-0 n0)
   added: (boarded p1 slow2-0) (passengers slow2-0 n1)
   goals met: 0 of 4
13. (move-down-slow slow2-0 n9 n8)
   deleted: (lift-at slow2-0 n9)
   added: (lift-at slow2-0 n8)
   goals met: 0 of 4
14. (leave p1 slow2-0 n8 n1 n0)
   deleted: (boarded p1 slow2-0) (passengers slow2-0 n1)
   added: (passenger-at p1 n8) (passengers slow2-0 n0)
   goals met: 0 of 4
15. (leave p0 fast0 n10 n2 n1)
   deleted: (boarded p0 fast0) (passengers fast0 n2)
   added: (passenger-at p0 n10) (passengers fast0 n1)
   goals met: 1 of 4
16. (board p2 fast0 n10 n1 n2)
   deleted: (passenger-at p2 n10) (passengers fast0 n1)
   added: (boarded p2 fast0) (passengers fast0 n2)
   goals met: 1 of 4
17. (board p1 slow1-0 n8 n0 n1)
   deleted: (passenger-at p1 n8) (passengers slow1-0 n0)
   added: (boarded p1 slow1-0) (passengers slow1-0 n1)
   goals met: 1 of 4
18. (move-down-slow slow1-0 n8 n5)
   deleted: (lift-at slow1-0 n8)
   added: (lift-at slow1-0 n5)
   goals met: 1 of 4
19. (leave p1 slow1-0 n5 n1 n0)
   deleted: (boarded p1 slow1-0) (passengers slow1-0 n1)
   added: (passenger-at p1 n5) (passengers slow1-0 n0)
   goals met: 2 of 4
20. (move-up-fast fast0 n10 n12)
   deleted: (lift-at fast0 n10)
   added: (lift-at fast0 n12)
   goals met: 2 of 4
21. (leave p2 fast0 n12 n2 n1)
   deleted: (boarded p2 fast0) (passengers fast0 n2)
   added: (passenger-at p2 n12) (passengers fast0 n1)
   goals met: 2 of 4
22. (board p2 slow3-0 n12 n0 n1)
   deleted: (passenger-at p2 n12) (passengers slow3-0 n0)
   added: (boarded p2 slow3-0) (passengers slow3-0 n1)
   goals met: 2 of 4
23. (leave p3 fast0 n12 n1 n0)
   deleted: (boarded p3 fast0) (passengers fast0 n1)
   added: (passenger-at p3 n12) (passengers fast0 n0)
   goals met: 2 of 4
24. (board p3 slow3-0 n12 n1 n2)
   deleted: (passenger-at p3 n12) (passengers slow3-0 n1)
   added: (boarded p3 slow3-0) (passengers slow3-0 n2)
   goals met: 2 of 4
25. (move-up-slow slow3-0 n12 n13)
   deleted: (lift-at slow3-0 n12)
   added: (lift-at slow3-0 n13)
   goals met: 2 of 4
26. (leave p3 slow3-0 n13 n2 n1)
   deleted: (boarded p3 slow3-0) (passengers slow3-0 n2)
   added: (passenger-at p3 n13) (passengers slow3-0 n1)
   goals met: 3 of 4
27. (move-up-slow slow3-0 n13 n15)
   deleted: (lift-at slow3-0 n13)
   added: (lift-at slow3-0 n15)
   goals met: 3 of 4
28. (leave p2 slow3-0 n15 n1 n0)
   deleted: (boarded p2 slow3-0) (passengers slow3-0 n1)
   added: (passenger-at p2 n15) (passengers slow3-0 n0)
   goals met: 4 of 4
